[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [Web Pages - Dev / static-web-page-on-ibm (ibm-website)](https://app.env0.com/p/feba4dde-3e2d-4d6f-a6e9-c24504694efe/environments/03cd0706-8367-4354-ac91-17a7f5df7969):
```
Plan: 3 to add, 1 to change, 3 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

OpenTofu will perform the following actions:


  # ibm_cos_bucket.standard-ams03 must be replaced
-/+ resource "ibm_cos_bucket" "standard-ams03" {
-       allowed_ip           = [] -> null
!       bucket_name          = "a-standard-bucket-at-ams-env0-test" -> "a-standard-bucket-at-ams-env0-test-1" # forces replacement
!       crn                  = "crn:v1:bluemix:public:cloud-object-storage:global:a/297b60a88bde4d92a9d4a07aff36b8d3:898bdf32-dbd7-4fd6-a303-c8c1c26857a3:bucket:a-standard-bucket-at-ams-env0-test" -> (known after apply)
-       hard_quota           = 0 -> null
!       id                   = "crn:v1:bluemix:public:cloud-object-storage:global:a/297b60a88bde4d92a9d4a07aff36b8d3:898bdf32-dbd7-4fd6-a303-c8c1c26857a3:bucket:a-standard-bucket-at-ams-env0-test:meta:ssl:ams03:public" -> (known after apply)
!       s3_endpoint_direct   = "s3.direct.ams03.cloud-object-storage.appdomain.cloud" -> (known after apply)
!       s3_endpoint_private  = "s3.private.ams03.cloud-object-storage.appdomain.cloud" -> (known after apply)
!       s3_endpoint_public   = "s3.ams03.cloud-object-storage.appdomain.cloud" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # ibm_cos_bucket_object.file must be replaced
-/+ resource "ibm_cos_bucket_object" "file" {
!       body            = <<-EOT
            <html>
            
            <head>
                <title>
                    Hello from env0!
                </title>
                <link href="https://fonts.googleapis.com/css?family=Roboto&display=swap" rel="stylesheet">
                <style>
                    body {
                        font-family: 'Roboto';
                        padding-top: 50px;
                        width: 40%;
                        margin: auto;
                        background-image: url("https://app.env0.com/static/media/background.06648d2b.svg");
                        background-size: cover;
                    }
            
                    div {
                        display: flex;
                        text-align: center;
                    }
            
                    .main {
                        flex-direction: column;
                    }
            
                    .power {
                        align-items: center;
                        justify-content: center;
                        margin-top: 20px;
                    }
            
                    img {
                        border-radius: 50px;
                    }
                </style>
            </head>
            
            <body>
                <div class="main">
                    <h1>Welcome to your own environment Omry</h1>
            
                    <img alt="hello" src="https://cataas.com/cat/says/Hello%20Omry" />
                    <div class="power">
                        <span>Powered by &nbsp;</span>
                        <a href="https://www.env0.com">
                            <img width="100px"
                                src="https://cdn.prod.website-files.com/63df9b273f861215467107c8/668fd303582961e81ef532fc_env0%20logo-dark.svg" />
                        </a>
                    </div>
                </div>
            </body>
            
            </html>
        EOT -> (known after apply)
!       bucket_crn      = "crn:v1:bluemix:public:cloud-object-storage:global:a/297b60a88bde4d92a9d4a07aff36b8d3:898bdf32-dbd7-4fd6-a303-c8c1c26857a3:bucket:a-standard-bucket-at-ams-env0-test" # forces replacement -> (known after apply) # forces replacement
!       content_length  = 1305 -> (known after apply)
!       content_type    = "text/html" -> (known after apply)
!       id              = "crn:v1:bluemix:public:cloud-object-storage:global:a/297b60a88bde4d92a9d4a07aff36b8d3:898bdf32-dbd7-4fd6-a303-c8c1c26857a3:bucket:a-standard-bucket-at-ams-env0-test:object:index.html:location:ams03" -> (known after apply)
!       last_modified   = "Wed, 11 Dec 2024 21:25:24 UTC" -> (known after apply)
!       object_sql_url  = "cos://ams03/a-standard-bucket-at-ams-env0-test/index.html" -> (known after apply)
+       version_id      = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # ibm_cos_bucket_website_configuration.website must be replaced
-/+ resource "ibm_cos_bucket_website_configuration" "website" {
!       bucket_crn       = "crn:v1:bluemix:public:cloud-object-storage:global:a/297b60a88bde4d92a9d4a07aff36b8d3:898bdf32-dbd7-4fd6-a303-c8c1c26857a3:bucket:a-standard-bucket-at-ams-env0-test" # forces replacement -> (known after apply) # forces replacement
!       id               = "crn:v1:bluemix:public:cloud-object-storage:global:a/297b60a88bde4d92a9d4a07aff36b8d3:898bdf32-dbd7-4fd6-a303-c8c1c26857a3:bucket:a-standard-bucket-at-ams-env0-test:meta:ams03:public" -> (known after apply)
!       website_endpoint = "https://a-standard-bucket-at-ams-env0-test.s3-web.ams03.cloud-object-storage.appdomain.cloud" -> (known after apply)
        # (2 unchanged attributes hidden)

!       website_configuration {
+           routing_rules = (known after apply)

            # (2 unchanged blocks hidden)
        }
    }

  # ibm_iam_access_group_policy.policy will be updated in-place
!   resource "ibm_iam_access_group_policy" "policy" {
        id                 = "AccessGroupId-PublicAccess/5c328729-95a7-46d5-a20c-49db7c68a627"
        # (5 unchanged attributes hidden)

!       resources {
!           resource             = "a-standard-bucket-at-ams-env0-test" -> "a-standard-bucket-at-ams-env0-test-1"
            # (4 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 1 to change, 3 to destroy.

```
</details>


```
Failed to calculate cost estimation
```

To *apply* this plan, use the following comment:
```
env0 apply -e ibm-website
```


[Full PR Plan logs on env0](https://app.env0.com/p/feba4dde-3e2d-4d6f-a6e9-c24504694efe/environments/03cd0706-8367-4354-ac91-17a7f5df7969/deployments/ecbd6d20-50b0-4b0e-80f1-5ef76c7932a4)